RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/include/cy_ipc_bt.h
/***************************************************************************//**
* \file cy_ipc_bt.h
* \version 1.70
*
* \brief
* Provides an API declaration for the BT IPC driver.
*
********************************************************************************
* \copyright
* Copyright (c) (2020-2022), Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation.
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#ifndef CY_IPC_BT_H
#define CY_IPC_BT_H

/******************************************************************************/
/* Include files                                                              */
/******************************************************************************/

#include "cy_device.h"

#if defined (CY_IP_MXIPC)

#include "cy_ipc_drv.h"
#include "cy_syslib.h"
#include "cy_sysint.h"

/**
* \addtogroup group_ipc_bt IPC Bluetooth sub-system layer (IPC_BTSS)
* \{
* All the HCI APIs are intended to be called by the stack interface layer, and
* not meant to be called by the application developers.
*
* The BT IPC functions provide a method to transfer Host Controller Interface (HCI)
* and High Priority Controller (HPC) messages between the MCU and BT SS.
*
* Include cy_ipc_bt.h. Alternatively include cy_pdl.h
* to get access to all functions and declarations in the PDL.
*
* The data needs to be provided in an array along with the payload type indicator.
* Depending on the payload length, the message gets formatted in to short or long
* message. If the payload length is less than 7 bytes, then it is considered as a short
* message. Short messages are packed and sent using IPC channel DATA0 and DATA1
* registers. Any payload length greater than 7 bytes will be sent using the buffers in
* the shared memory.
*
* It supports callback function for notification on receiving the HCI messages from the BT SS
* HCI notification callback function is registered during the initialization of the driver.
* It also supports multiple callback registration for notification on receiving the
* HPC messages.
*
*     \defgroup group_ipc_bt_macros Macros
*       Macro definitions are used in the driver
*
*     \defgroup group_ipc_bt_functions Functions
*       Functions are used in the driver
*
*     \defgroup group_ipc_bt_data_structures Data Structures
*       Data structures are used in the driver
*
*     \defgroup group_ipc_bt_enums Enumerated Types
*       Enumerations are used in the driver
* \}
*
*/

//#define BT_OLD_INIT
/* Enable below macro to get BT IPC statistics */
#define CY_BTIPC_STATS

/**
* \addtogroup group_ipc_bt_macros
* \{
*/

/** Software PDL driver ID for IPC BT  functions */
#define CY_BT_IPC_ID CY_IPC_ID

/** Return prefix for BT IPC driver function status codes */
#define CY_BT_IPC_ID_INFO    (uint32_t)( CY_BT_IPC_ID | CY_PDL_STATUS_INFO )

/** Return prefix for BT IPC driver function warning return values */
#define CY_BT_IPC_ID_WARNING (uint32_t)( CY_BT_IPC_ID | CY_PDL_STATUS_WARNING)

/** Return prefix for BT IPC driver function error return values */
#define CY_BT_IPC_ID_ERROR   (uint32_t)( CY_BT_IPC_ID | CY_PDL_STATUS_ERROR)

/** Maximum HPC callback supported */
#define MAX_BT_IPC_HPC_CB 10

/** Maximum number of buffers in the pool */
#define MAX_BUF_COUNT 4

/** Maximum number of buffers to be released */
#define MAX_TO_FREE_BUF_COUNT 5

/** Maximum size of IPC FIFO */
#define MAX_IPC_FIFO_SIZE 5

/** \} group_ipc_bt_macros */


/** Maximum length of short message */
#define MAX_SHORT_MESG_LENGTH 7

/** Buffer descriptor length in init message */
#define BUFFER_DESCRIPTION_LEN 7

/** size of cy_stc_ipc_msg_subheader_t structure */
#define SUB_HEADER_SIZE 4

/**
* \addtogroup group_ipc_bt_enums
* \{
*/
/**
* This is a list of ENUMs used for function return status.
*/
typedef enum
{
    CY_BT_IPC_DRV_SUCCESS            =(uint32_t)(0x00u),                     /**<  BT IPC API return for no error */
    CY_BT_IPC_DRV_ERROR              =(uint32_t)(CY_BT_IPC_ID_ERROR | 1UL),  /**<  BT IPC API return for general error */
    CY_BT_IPC_DRV_ERROR_BAD_HANDLE   =(uint32_t)(CY_BT_IPC_ID_ERROR | 2UL),  /**<  BT IPC API return for bad handle */
    CY_BT_IPC_DRV_ERROR_CH_BUSY      =(uint32_t)(CY_BT_IPC_ID_ERROR | 3UL),  /**<  BT IPC API return for channel busy */
    CY_BT_IPC_DRV_ERROR_LOCK_REL     =(uint32_t)(CY_BT_IPC_ID_ERROR | 4UL),  /**<  BT IPCAPI return for channel release error */
    CY_BT_IPC_DRV_ERROR_LOCK_ACQUIRE =(uint32_t)(CY_BT_IPC_ID_ERROR | 5UL),  /**<  BT IPC API return for channel release error */
    CY_BT_IPC_DRV_ERROR_BUF_GET      =(uint32_t)(CY_BT_IPC_ID_ERROR | 6UL),  /**<  BT IPC API return for get buffer error */
    CY_BT_IPC_DRV_ERROR_BUF_FULL     =(uint32_t)(CY_BT_IPC_ID_ERROR | 7UL),  /**<  BT IPC API return for buffer full error */
    CY_BT_IPC_DRV_ERROR_BUF_EMPTY    =(uint32_t)(CY_BT_IPC_ID_ERROR | 8UL),  /**<  BT IPC API return for buffer empty error */
    CY_BT_IPC_DRV_ERROR_BUF_PRESENT  =(uint32_t)(CY_BT_IPC_ID_ERROR | 9UL),  /**<  BT IPC API return for buffer already present error */
    CY_BT_IPC_DRV_ERROR_BUF_SIZE     =(uint32_t)(CY_BT_IPC_ID_ERROR | 10UL), /**<  BT IPC API return for buffer of size not available error */
    CY_BT_IPC_DRV_ERROR_PARAM        =(uint32_t)(CY_BT_IPC_ID_ERROR | 11UL), /**<  BT IPC API return for bad parameter error */
} cy_en_btipcdrv_status_t;

/**
* This is a list of ENUMs used for buffer types.
*/
typedef enum
{
    CY_BT_IPC_CTRL_BUF           = (0x00u),                /**<  Control buffer type */
    CY_BT_IPC_HCI_CMD_BUF        = (0x01u),                /**<  Command buffer type */
    CY_BT_IPC_HCI_BREDR_BUF      = (0x02u),                /**<  BR/EDR buffer type */
    CY_BT_IPC_HCI_BLE_BUF        = (0x03u),                /**<  BLE buffer type */
    CY_BT_IPC_HCI_ISOC_BUF       = (0x04u),                /**<  ISOC buffer type */
    CY_BT_IPC_HCI_INVALID_BUF    = (0xFFu),                /**<  Invalid buffer type */
} cy_en_btipc_buftype_t;

/**
* This is a list of ENUMs used for HCI packet type.
*/
typedef enum
{
    CY_BT_IPC_HCI_IGNORE         = (0x00u),                /**<  HCI payload type ignore */
    CY_BT_IPC_HCI_CMD            = (0x01u),                /**<  HCI payload type command */
    CY_BT_IPC_HCI_ACL            = (0x02u),                /**<  HCI payload type ACL */
    CY_BT_IPC_HCI_SCO            = (0x03u),                /**<  HCI payload type SCO */
    CY_BT_IPC_HCI_EVT            = (0x04u),                /**<  HCI payload type Event */
    CY_BT_IPC_HCI_ISO            = (0x05u),                /**<  HCI payload type ISO */
    CY_BT_IPC_HCI_DIAG           = (0x07u),                /**<  HCI payload type Diagnostics */
    CY_BT_IPC_HCI_MPAF           = (0x0Au),                /**<  HCI payload type MPAF */
    CY_BT_IPC_HCI_SLIPH5         = (0xC0u),                /**<  HCI payload type SLIPH5 */
    CY_BT_IPC_HCI_LONG           = (0xFFu),                /**<  HCI payload type long message */
} cy_en_btipc_hcipti_t;

/**
* This is a list of ENUMs used for HPC packet type.
*/
typedef enum
{
    CY_BT_IPC_HPC_RESERVED       = (0x00u),                /**<..Reserved (not used) */
    CY_BT_IPC_HPC_BUFRELEASE     = (0x01u),                /**<  HPC payload type buffer release, sent from MCU only */
    CY_BT_IPC_HPC_REQTRNG        = (0x02u),                /**<  HPC payload type request TRNG */
    CY_BT_IPC_HPC_BUFPROVIDE     = (0x03u),                /**<  HPC payload type provide buffer, sent from BT only */
    CY_BT_IPC_HPC_PM             = (0x04u),                /**<  HPC payload type PM control */
    CY_BT_IPC_HPC_RESACCESS      = (0x05u),                /**<  HPC payload type Resource Access */
    CY_BT_IPC_HPC_LONG           = (0xFFu),                /**<  HPC payload type long message */
} cy_en_btipc_hpcpti_t;

/**
* This is a list of ENUMs used for HPC long message type.
*/
typedef enum
{
    CY_BT_IPC_HPC_INIT           = (0x01u),                /**<..Init message */
    CY_BT_IPC_HPC_HADM           = (0x02u),                /**<  HADM data message from BTSS to MCU */
    CY_BT_IPC_HPC_DUMMY          = (0x10u),                /**<  DUMMY data message from MCU to BTSS */
} cy_en_btipc_hpcmsgid_t;

/**
* This is a list of ENUMs used for bt boot type.
*/
typedef enum
{
#ifdef BT_OLD_INIT
    CY_BT_IPC_COLD_BOOT                     = (0x00u),     /**<  BTSS was reset and is in colds boot */
#endif
    CY_BT_IPC_BOOT_CONFIG_WAIT              = (0x00u),     /**<  BTSS is reset and is in boot waiting for a config from the MCU. If certificate error indicates any error processing certificates */
    CY_BT_IPC_BOOT_FULLY_UP                 = (0x01u),     /**<  BTSS is fully up. It either processed a config from the MCU, or the MCU did not send a config. If the certificate error value is non-zero, there was an error processing certificates after getting the config, but the boot continued anyway. */
} cy_en_btipc_boottype_t;

/**
* This is a list of ENUMs used in PM command from MCU to BTSS
*/
typedef enum
{
    CY_BT_IPC_PM_HIBERNATE_CMD   = (0x01u),                /**< Command for Hibernate state */
} cy_en_btipc_pm_cmd_t;

/**
* This is a list of ENUMs used in PM response from BTSS to MCU
*/
typedef enum
{
    CY_BT_IPC_PM_ACCEPTED        = (0x00u),                /**< PM command accepted */
    CY_BT_IPC_PM_REJECTED        = (0x01u),                /**< PM command rejected */
} cy_en_btipc_pm_resp_t;

/**
*  This is a list of ENUMs used in resource access request from BTSS to MCU
*/
typedef enum
{
    CY_BT_IPC_RESACC_DI          = (0x00u),                /**< Resource access disable request */
    CY_BT_IPC_RESACC_EN          = (0x01u),                /**< Resource access enable request */
} cy_en_btipc_recacc_req_t;

/**
*  This is a list of ENUMs used as response from MCCU to BTSS for resource access request
*/
typedef enum
{
    CY_BT_IPC_RESACC_ACCEPTED    = (0x00u),                /**< Resource access request accepted */
    CY_BT_IPC_RESACC_REJECTED    = (0x01u),                /**< Resource access request rejected */
}cy_en_btipc_recacc_resp_t;

/**
* This is a list of ENUMs used for HCI DAIG packet type.
*/
typedef enum
{
    CY_BT_IPC_HCI_DIAG_IN_PKT_ID_NOP                       = (0x00U),
    CY_BT_IPC_HCI_DIAG_IN_PKT_ID_ALIVE_IND                 = (0x02U),
    CY_BT_IPC_HCI_DIAG_IN_PKT_ID_CPU_LOAD                  = (0x10U),
    CY_BT_IPC_HCI_DIAG_IN_PKT_ID_RESET_STATS               = (0xB9U),
    CY_BT_IPC_HCI_DIAG_IN_PKT_ID_LMP_LOG                   = (0xF0U),
    CY_BT_IPC_HCI_DIAG_IN_PKT_ID_MEM_PEEK                  = (0xF1U),
    CY_BT_IPC_HCI_DIAG_IN_PKT_ID_MEM_POKE                  = (0xF2U),
    CY_BT_IPC_HCI_DIAG_IN_PKT_ID_MEM_HEXDUMP               = (0xF3U),
    CY_BT_IPC_HCI_DIAG_IN_PKT_ID_SEND_STATS                = (0xF4U),
    CY_BT_IPC_HCI_DIAG_IN_PKT_ID_BB_PKT_TEST               = (0xF6U),
    CY_BT_IPC_HCI_DIAG_IN_PKT_ID_PICO_TEST                 = (0xF7U),
    CY_BT_IPC_HCI_DIAG_IN_PKT_ID_HCI_LOG                   = (0xF8U),
    CY_BT_IPC_HCI_DIAG_IN_PKT_ID_PICO_STATS                = (0xF9U),
    CY_BT_IPC_HCI_DIAG_IN_PKT_ID_AUX_STATS                 = (0xFAU),
    CY_BT_IPC_HCI_DIAG_IN_PKT_ID_SEND_RSSI                 = (0xFBU),
    CY_BT_IPC_HCI_DIAG_IN_PKT_ID_BAD_EVENT_LOG             = (0xFCU),
    CY_BT_IPC_HCI_DIAG_IN_PKT_ID_READ_2040_GPIO            = (0xFDU),
    CY_BT_IPC_HCI_DIAG_IN_PKT_ID_SEND_BASIC_RATE_ACL_STATS = (0xC1U),
    CY_BT_IPC_HCI_DIAG_IN_PKT_ID_SEND_EDR_ACL_STATS        = (0xC2U),
    CY_BT_IPC_HCI_DIAG_IN_PKT_ID_2045_AUX_STATS            = (0xC3U),
    CY_BT_IPC_HCI_DIAG_IN_PKT_ID_SEND_BASIC_RATE_SCO_STATS = (0xC5U),
    CY_BT_IPC_HCI_DIAG_IN_PKT_ID_SEND_EDR_SCO_STATS        = (0xC6U),
    CY_BT_IPC_HCI_DIAG_IN_PKT_ID_BLE_CONN_STATS            = (0xCFU),
}cy_en_btipc_hci_diag_msg_type_t;


/** \} group_ipc_bt_enums */

