RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/include/cy_ipc_bt.h
/*
 * This section defines the system level constants required to define
 * callback arrays for the Cypress pipe and the user pipe.  These defines
 * are used for both the max callback count and maximum clients.
*/

/** Typedef for bt ipc  callback function pointer */
typedef void (* cy_ipc_bt_callback_ptr_t)(uint32_t * msgPtr);

/** Typedef for bt ipc channel release callback function pointer */
typedef void (* cy_ipc_bt_relcallback_ptr_t)(void);

/** Typedef for bt ipc buffer available callback function pointer */
typedef void (* cy_ipc_bt_bufcallback_ptr_t)(cy_en_btipc_buftype_t bufType);

/** Typedef for bt ipc irq function pointer */
typedef void (* cy_ipc_bt_irq_handler_t)(void);

/**
* \addtogroup group_ipc_bt_data_structures
* \{
*/

/**
* This is the definition of an allocation msg structure.
*/
typedef struct cy_stc_ipc_msg_alloc_t
{
    uint8_t pti;                                    /**< Payload type indicator */
    uint8_t bufType;                                /**< Buffer type indicator */
    uint16_t bufSize;                               /**< Buffer size */
    uint8_t *bufAddr;                               /**< Pointer to the buffer */
} cy_stc_ipc_msg_alloc_t;

/**
* This is the definition of a long message structure.
*/
typedef struct cy_stc_ipc_msg_buff_t
{
    uint8_t pti;                                    /**< Payload type indicator */
    uint8_t actualPti;                              /**< Actual PTI for the long messages */
    uint16_t bufSize;                               /**< Buffer size */
    uint8_t *bufAddr;                               /**< Pointer to the buffer */
} cy_stc_ipc_msg_buff_t;

/**
* This is the definition of a short msg structure.
*/
typedef struct cy_stc_ipc_msg_short_t
{
    uint8_t pti;                                    /**< Payload type indicator */
    uint8_t db0;                                    /**< Payload byte 0 for short message */
    uint8_t db1;                                    /**< Payload byte 1 for short message */
    uint8_t db2;                                    /**< Payload byte 2 for short message */
    uint8_t db3;                                    /**< Payload byte 3 for short message */
    uint8_t db4;                                    /**< Payload byte 4 for short message */
    uint8_t db5;                                    /**< Payload byte 5 for short message */
    uint8_t db6;                                    /**< Payload byte 6 for short message */
} cy_stc_ipc_msg_short_t;

/** \} group_ipc_bt_data_structures */

/**
* This is the definition of an init msg structure.
*/
#ifdef BT_OLD_INIT
typedef struct cy_stc_ipc_msg_init_t
#else
typedef __PACKED_STRUCT cy_stc_ipc_msg_init_t
#endif
{
    uint8_t msgId;                                  /**< Message ID for HPC Long message */
    uint8_t payLoadLen;                             /**< Payload length in bytes */
    uint8_t bootType;                               /**< BT boot type indicator */
#ifndef BT_OLD_INIT
    uint32_t certError;                             /**< Certificate error value */
#endif
} cy_stc_ipc_msg_init_t;

/**
* This is the definition of a sub header msg structure.
*/
typedef __PACKED_STRUCT cy_stc_ipc_msg_subheader_t
{
    uint8_t msgId;                                  /**< Message ID for HPC message */
    uint8_t dummy;                                  /**< Dummy byte to be ignored */
    uint16_t payLoadLen;                            /**< Payload length in bytes */
} cy_stc_ipc_msg_subheader_t;

/**
* This is the definition of buffer descriptor structure.
*/
typedef struct cy_stc_ipc_bt_buf_t
{
    cy_en_btipc_buftype_t bufType;                  /**< Buffer type indicator */
    uint16_t bufLen;                                /**< Buffer length */
    uint8_t *bufPtr;                                /**< Pointer to the buffer */
} cy_stc_ipc_bt_buf_t;

/**
* This is the definition of buffer descriptor optimized for context store/restore.
*/
typedef struct cy_stc_ipc_bt_ctxbuf_t
{
    uint16_t bufType;                               /**< Buffer type indicator */
    uint16_t bufLen;                                /**< Buffer length */
    uint8_t *bufPtr;                                /**< Pointer to the buffer */
} cy_stc_ipc_bt_ctxbuf_t;


/* Following are the HCI packet header typedefs */
/**
* This is the definition of CMD header structure.
*/
typedef __PACKED_STRUCT BTHCI_CMD_HDR_t
{
    uint16_t opcode;
    uint8_t params_len;
} BTHCI_CMD_HDR_t;

/**
* This is the definition of event header structure.
*/
typedef struct BTHCI_EVENT_HDR_t
{
    uint8_t   code; /**< code */
    uint8_t   params_len; /**< params_len */
} BTHCI_EVENT_HDR_t;

/**
* This is the definition of ACL header structure.
*/
typedef __PACKED_STRUCT BTHCI_ACL_HDR_t
{
    uint16_t  conn_handle_and_flags;
    uint16_t  data_len;
} BTHCI_ACL_HDR_t;

/**
* This is the definition of ISO header structure.
*/
typedef __PACKED_STRUCT BTHCI_ISO_HDR_t
{
    uint16_t  conn_handle_and_flags;
    uint16_t  data_len;
} BTHCI_ISO_HDR_t;

/**
* This is the definition of SCO header structure.
*/
typedef struct BTHCI_SCO_HDR_t
{
    __PACKED_UNION
    {
        uint16_t  audioChannel; /**< audioChannel */
        uint16_t  connectionHandle; /**< connectionHandle*/
    }   u; /**< u */
    uint8_t  data_len; /**< data_len */
} BTHCI_SCO_HDR_t;

/** Typedef for internal ipc callback function pointer */
typedef void (* cy_ipc_bt_int_cb_ptr_t)(void *btIpcContext, uint32_t * msgPtr);

/**
* This is the definition of IPC message.
*/
typedef struct cy_stc_ipc_msg_t
{
    uint32_t msg[2];                                /**< IPC message */
} cy_stc_ipc_msg_t;

/**
* This is the definition of fifo for IPC messages.
*/
typedef struct cy_stc_ipc_msg_fifo_t
{
    cy_stc_ipc_msg_t fifo[MAX_IPC_FIFO_SIZE];       /**< FIFO for IPC messages */
    uint8_t rdIdx;                                  /**< FIFO read index */
    uint8_t wrIdx;                                  /**< FIFO write index */
    uint8_t bufLen;                                 /**< Number of FIFO entries */
} cy_stc_ipc_msg_fifo_t;

/**
* \addtogroup group_ipc_bt_data_structures
* \{
*/

/**
* This is the definition of HPC callback structure.
*/
typedef struct cy_stc_ipc_hcp_cb_t
{
    cy_en_btipc_hpcpti_t msgType;                    /**< HPC Message Type */
    cy_ipc_bt_callback_ptr_t hpcNotifyCallbackPtr;   /**< HPC Callback pointer for control channel notification */
} cy_stc_ipc_hcp_cb_t;


/**
* This is the definition of BT IPC context structure.
*/
typedef struct cy_stc_ipc_bt_context_t
{
    uint32_t ulChannelHCI;                                    /**< HCI Channel used to send to BLE */
    uint32_t dlChannelHCI;                                    /**< HCI Channel used to receive from BLE */

