RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/include/cy_ipc_bt.h
/*******************************************************************************
* Function Name: Cy_BTIPC_HPC_GetWriteBufPtr
****************************************************************************//**
*
* This function gets the pointer to the buffer to write HPC long message packet to
* send to BTSS.
*
* \param ppData
* This is the pointer to the pointer of buffer to write HPC long message payload buffer
*
* \param length
* This is the length of the HPC payload in number of bytes.
*
* \param btIpcContext
* This is the pointer to the bt ipc context structure
*
* \return
*    CY_BT_IPC_DRV_SUCCESS:             BT IPC API return for no error
*    CY_BT_IPC_DRV_ERROR_BAD_HANDLE:    BT IPC API return for bad handle
*    CY_BT_IPC_DRV_ERROR_LOCK_ACQUIRE:  BT IPC API return for buffer pool full error
*    CY_BT_IPC_DRV_ERROR_LOCK_REL:      BT IPCAPI return for channel release error
*
*******************************************************************************/
cy_en_btipcdrv_status_t Cy_BTIPC_HPC_GetWriteBufPtr(cy_stc_ipc_bt_context_t *btIpcContext, void **ppData, size_t length);


/*******************************************************************************
* Function Name: Cy_BTIPC_HCI_RelChannel
****************************************************************************//**
*
* This function releases the HCI channel after handling the notification from the
* BT SS
*
* \param btIpcContext
* This is the pointer to the bt ipc context structure
*
* \return
*    CY_BT_IPC_DRV_SUCCESS:             BT IPC API return for no error
*    CY_BT_IPC_DRV_ERROR_BAD_HANDLE:    BT IPC API return for bad handle
*    CY_BT_IPC_DRV_ERROR_LOCK_REL:      BT IPCAPI return for channel release error
*
*******************************************************************************/
cy_en_btipcdrv_status_t Cy_BTIPC_HCI_RelChannel(cy_stc_ipc_bt_context_t *btIpcContext);


/*******************************************************************************
* Function Name: Cy_BTIPC_HCI_RelBuffer
****************************************************************************//**
*
* This function releases the HCI buffer after copying the data received from BTSS
*
* \param btIpcContext
* This is the pointer to the bt ipc context structure
*
* \param msgPtr
* This is the pointer to the IPC message received form BTSS
*
* \return
*    CY_BT_IPC_DRV_SUCCESS:             BT IPC API return for no error
*    CY_BT_IPC_DRV_ERROR_BAD_HANDLE:    BT IPC API return for bad handle
*    CY_BT_IPC_DRV_ERROR_LOCK_REL:      BT IPCAPI return for channel release error
*
*******************************************************************************/
cy_en_btipcdrv_status_t Cy_BTIPC_HCI_RelBuffer(cy_stc_ipc_bt_context_t *btIpcContext, uint32_t* msgPtr);


/*******************************************************************************
* Function Name: Cy_BTIPC_HPC_RelChannel
****************************************************************************//**
*
* This function releases the HPC channel after handling the notification from the
* BT SS
*
* \param buf
* This is the pointer to the buffer received from BT SS in DATA0 and DATA1 channel
* registers.
*
* \param btIpcContext
* This is the pointer to the bt ipc context structure
*
* \return
*    CY_BT_IPC_DRV_SUCCESS:             BT IPC API return for no error
*    CY_BT_IPC_DRV_ERROR_BAD_HANDLE:    BT IPC API return for bad handle
*    CY_BT_IPC_DRV_ERROR_LOCK_REL:      BT IPCAPI return for channel release error
*
*******************************************************************************/
cy_en_btipcdrv_status_t Cy_BTIPC_HPC_RelChannel(cy_stc_ipc_bt_context_t *btIpcContext, void * buf);


/*******************************************************************************
* Function Name: Cy_BTIPC_HCI_RegisterCb
****************************************************************************//**
*
* This function registers the callback for HCI message notifications from BT SS
*
* \param hciNotifyCallbackPtr
* This is the pointer to the function to be called for HCI notifications.
*
* \param btIpcContext
* This is the pointer to the bt ipc context structure
*
* \return
*    CY_BT_IPC_DRV_SUCCESS:             BT IPC API return for no error
*    CY_BT_IPC_DRV_ERROR_BAD_HANDLE:    BT IPC API return for bad handle
*
*******************************************************************************/
cy_en_btipcdrv_status_t Cy_BTIPC_HCI_RegisterCb(cy_stc_ipc_bt_context_t *btIpcContext, cy_ipc_bt_callback_ptr_t hciNotifyCallbackPtr);


/*******************************************************************************
* Function Name: Cy_BTIPC_HCI_UnregisterCb
****************************************************************************//**
*
* This function un-registers the callback function registered for HCI message
* notifications from BT SS
*
* \param btIpcContext
* This is the pointer to the bt ipc context structure
*
* \return
*    CY_BT_IPC_DRV_SUCCESS:             BT IPC API return for no error
*    CY_BT_IPC_DRV_ERROR_BAD_HANDLE:    BT IPC API return for bad handle
*
*******************************************************************************/
cy_en_btipcdrv_status_t Cy_BTIPC_HCI_UnregisterCb(cy_stc_ipc_bt_context_t *btIpcContext);


/*******************************************************************************
* Function Name: Cy_BTIPC_HPC_RegisterCb
****************************************************************************//**
*
* This function registers the callback for HPC message notifications from BT SS
*
* \param pHpcNotifyCallbackParam
* This is the pointer to the function to be called for HPC notifications.
*
* \param btIpcContext
* This is the pointer to the bt ipc context structure
*
* \return
*    CY_BT_IPC_DRV_SUCCESS:             BT IPC API return for no error
*    CY_BT_IPC_DRV_ERROR_BAD_HANDLE:    BT IPC API return for bad handle
*    CY_BT_IPC_DRV_ERROR:               BT IPC API return for general error
*
*******************************************************************************/
cy_en_btipcdrv_status_t Cy_BTIPC_HPC_RegisterCb(cy_stc_ipc_bt_context_t *btIpcContext, cy_stc_ipc_hcp_cb_t *pHpcNotifyCallbackParam);


