RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/include/cy_ipc_bt.h
/*******************************************************************************
* Function Name: Cy_BTIPC_HPC_UnregisterCb
****************************************************************************//**
*
* This function un-registers the callback function registered for HPC message
* notifications from BT SS
*
* \param pHpcNotifyCallbackParam
* This is the pointer to the callback function to be un-registered.
*
* \param btIpcContext
* This is the pointer to the bt ipc context structure
*
* \return
*    CY_BT_IPC_DRV_SUCCESS:             BT IPC API return for no error
*    CY_BT_IPC_DRV_ERROR_BAD_HANDLE:    BT IPC API return for bad handle
*    CY_BT_IPC_DRV_ERROR:               BT IPC API return for general error
*
*******************************************************************************/
cy_en_btipcdrv_status_t Cy_BTIPC_HPC_UnregisterCb(cy_stc_ipc_bt_context_t *btIpcContext, cy_stc_ipc_hcp_cb_t *pHpcNotifyCallbackParam);


/*******************************************************************************
* Function Name: Cy_BTIPC_Buffer_RegisterCb
****************************************************************************//**
*
* This function registers the callback for buffer available notification
*
* \param bufCallbackPtr
* This is the pointer to the function to be called for buffer available notification.
*
* \param btIpcContext
* This is the pointer to the bt ipc context structure
*
* \return
*    CY_BT_IPC_DRV_SUCCESS:             BT IPC API return for no error
*    CY_BT_IPC_DRV_ERROR_BAD_HANDLE:    BT IPC API return for bad handle
*    CY_BT_IPC_DRV_ERROR:               BT IPC API return for general error
*
*******************************************************************************/
cy_en_btipcdrv_status_t Cy_BTIPC_Buffer_RegisterCb(cy_stc_ipc_bt_context_t *btIpcContext, cy_ipc_bt_bufcallback_ptr_t bufCallbackPtr);


/*******************************************************************************
* Function Name: Cy_BTIPC_HCI_FIFOGet
****************************************************************************//**
*
* This function is called to pull the IPC message from FIFO.
*
* \param ppMsg
* This is the pointer to pointer the location in FIFO where the retrieved message is stored.
*
* \param delete
* When set to 1, the entry from the FIFO is deleted after pulling it.
*
* \param btIpcContext
* This is the pointer to the bt ipc context structure
*
* \return
*    CY_BT_IPC_DRV_SUCCESS:             BT IPC API return for no error
*    CY_BT_IPC_DRV_ERROR_BUF_FULL  :    BT IPC API return for FIFO full
*
*******************************************************************************/
cy_en_btipcdrv_status_t Cy_BTIPC_HCI_FIFOGet(cy_stc_ipc_bt_context_t *btIpcContext, uint32_t **ppMsg, uint8_t delete);


/*******************************************************************************
* Function Name: Cy_BTIPC_HCI_FIFOCount
****************************************************************************//**
*
* This function is called to get the number of messages in the IPC FIFO.
*
* \param btIpcContext
* This is the pointer to the bt ipc context structure
*
* \return
*    number of messages in the IPC FIFO
*
*******************************************************************************/
uint16_t Cy_BTIPC_HCI_FIFOCount(cy_stc_ipc_bt_context_t *btIpcContext);


/*******************************************************************************
* Function Name: Cy_BTIPC_RetrieveContext
****************************************************************************//**
*
* This function is called to retrieve the context to be saved during RAM off
* state.
*
* \param pContextRet
* Pointer to the context to be retrieved. This will be updated by this function.
*
* \param btIpcContext
* This is the pointer to the bt ipc context structure
*
* \return
*    CY_BT_IPC_DRV_SUCCESS:             BT IPC API return for no error
*    CY_BT_IPC_DRV_ERROR_BAD_HANDLE:    BT IPC API return for bad handle
*
*******************************************************************************/
cy_en_btipcdrv_status_t Cy_BTIPC_RetrieveContext(cy_stc_ipc_bt_context_t *btIpcContext, cy_stc_ipc_bt_save_ctxt_t *pContextRet);


/*******************************************************************************
* Function Name: Cy_BTIPC_RestoreContext
****************************************************************************//**
*
* This function is called to restore the saved context during RAM off state.
*
* \param pContextRet
* Pointer to the saved context structure to be restored
*
* \param btIpcContext
* This is the pointer to the bt ipc context structure
*
* \return
*    CY_BT_IPC_DRV_SUCCESS:             BT IPC API return for no error
*    CY_BT_IPC_DRV_ERROR_BAD_HANDLE:    BT IPC API return for bad handle
*
*******************************************************************************/
cy_en_btipcdrv_status_t Cy_BTIPC_RestoreContext(cy_stc_ipc_bt_context_t *btIpcContext, cy_stc_ipc_bt_save_ctxt_t *pContextRet);


/** \} group_ipc_bt_functions */

void Cy_BTIPC_IRQ_Handler(cy_stc_ipc_bt_context_t *btIpcContext);

/* This function prototype will be removed once the simulations are done */
void Cy_BTIPC_HPC_Notify(void *btIpcContext, uint32_t * msgPtr);
/* This function will print the BT IPC driver status */
#ifdef BTIPC_STATUS
cy_en_btipcdrv_status_t Cy_bt_PrintStatus (cy_stc_ipc_bt_context_t *btIpcContext);
#endif
/** \} group_ipc_bt */

#ifdef __cplusplus
}
#endif

#endif /* CY_IP_MXIPC */

#endif /* !defined (CY_IPC_BT_H) */

/* [] END OF FILE */
